In [28]:
import numpy as np
import pandas as pd
import seaborn as sns
%matplotlib inline

test_dict = {"popularity":[1.8,1.2,3,2.2,1.2,3.2,5],"revenue":[6,5,3,3,4,5,6],"budget":[2,3,2,1,3,1,2],
             "release_year":["1991","1991","1992","1993","1993","1994","1994"]}
movie_data = pd.DataFrame(test_dict)
#sns.barplot(x="original_title",y="popularity",data = movie_data)
movie_data.sort_values(by='popularity',axis=0,ascending=True)

   popularity  revenue  budget release_year
1         1.2        5       3         1991
4         1.2        4       3         1993
0         1.8        6       2         1991
3         2.2        3       1         1993
2         3.0        3       2         1992
5         3.2        5       1         1994
6         5.0        6       2         1994

In [29]:
movie_data = movie_data.groupby('release_year').agg('mean')
movie_data
# movie_data['profit'] = movie_data['revenue']-movie_data['budget']
# movie_data = movie_data.reset_index()
# movie_data

              popularity  revenue  budget
release_year
1991                 1.5      5.5     2.5
1992                 3.0      3.0     2.0
1993                 1.7      3.5     2.0
1994                 4.1      5.5     1.5

In [27]:
movie_data

              popularity  revenue  budget
release_year
1991                 3.0       11       5
1992                 3.0        3       2
1993                 3.4        7       4
1994                 8.2       11       3

In [4]:
new_data = movie_data.groupby('original_title').agg('sum')
new_data

                popularity  revenue  newcolumn
original_title
movie 1                3.0        3        7.0
movie 2                3.0        3        5.0
movie 3                3.4        6        7.4
movie 4                3.2        5        5.2
movie 5                5.0        6        7.0

In [5]:
new_data['pn'] = new_data['popularity']+new_data['newcolumn']
new_data

                popularity  revenue  newcolumn    pn
original_title
movie 1                3.0        3        7.0  10.0
movie 2                3.0        3        5.0   8.0
movie 3                3.4        6        7.4  10.8
movie 4                3.2        5        5.2   8.4
movie 5                5.0        6        7.0  12.0

In [24]:
result = new_data.reset_index()
result
# type(index_data)
# print(index_data)
# sns.barplot(x=index_data,y="pn",data = new_data)

  original_title  popularity  revenue  newcolumn    pn
0        movie 1         3.0        3        7.0  10.0
1        movie 2         3.0        3        5.0   8.0
2        movie 3         3.4        6        7.4  10.8
3        movie 4         3.2        5        5.2   8.4
4        movie 5         5.0        6        7.0  12.0

In [22]:
movie_data.isnull().any(axis=1)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [7]:
item = pd.Series(data=[1,2,3,4,5],index=['a','b','c','d','e'])

In [9]:
item_dict = {'ben':[2,3,4,2,1]}
pd.DataFrame(item_dict)

   ben
0    2
1    3
2    4
3    2
4    1